import { useEffect, useState } from "react";
import Trivia from "./Trivia";
import Timer from "./Timer";

function App() {
  const [questionNumber, setQuestionNumber] = useState(1);
  const [timeOut, setTimeOut] = useState(false);
  const [earned, setEarned] = useState();

  const data = [{
    id: 1,
    question: "საერთაშორისო ჟიურიში ოთხი წევრია: დავითი, მაიკლი, თეონა და ანა. თითოეულმა მათგანმა დანარჩენი სამიდან ერთ-ერთი დაასახელა ჟიურის თავმჯდომარედ. ცნობილია, რომ:ანამ დაასახელა დავითი. ჟიურის ორმა წევრმა დაასახელა თეონა. ქვემოთ ჩამოთვლილთაგან რომელია შეუძლებელი?",
    answers: [
      {
        text: "თეონამ დაასახელა ანა;",
        correct: false,
      },
      {
        text: "დავითმა დაასახელა მაიკლი",
        correct: true,
      },
      {
        text: "თეონამ დაასახელა დავითი; ",
        correct: false,
      },
      {
        text: "დავითმა დაასახელა თეონა;",
        correct: false,
      },
    ],
  },
  {
    id: 2,
    question: "მოცემულია სამი დებულება:ყველა ინჟინერი სპორტსმენია.ყველა ფილოსოფოსი სპორტსმენია.არც ერთი ინჟინერი არ არის ფილოსოფოსი.თუ ეს დებულებები ჭეშმარიტია, მაშინ ქვემოთ ჩამოთვლილთაგან რომელი არ შეიძლება იყოს ჭეშმარიტი?",
    answers: [
      {
        text: "ზოგიერთი არასპორტსმენი ფილოსოფოსია;",
        correct: true,
      },
      {
        text: " ზოგიერთი არაფილოსოფოსი ინჟინერია;",
        correct: false,
      },
      {
        text: "ზოგიერთი არაინჟინერი არ არის ფილოსოფოსი; ",
        correct: false,
      },
      {
        text: "ზოგიერთი არასპორტსმენი არ არის ფილოსოფოსი",
        correct: false,
      },
    ],
  },
  {
    id: 3,
    question: "მოცემულია დებულებები:თუ ადამიანი გონიერია, მაშინ ის კეთილიც არის.ზოგიერთი ადამიანი კეთილია, მაგრამ არ არის წინდახედული.არ არსებობს გონიერი ადამიანი, რომელიც წინდახედული არ არის.თუ ეს დებულებები ჭეშმარიტია, მაშინ ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად მცდარი?",
    answers: [
      {
        text: "თუ კეთილი ადამიანი გონიერი არ არის, მაშინ ის არ არის წინდახედული",
        correct: false,
      },
      {
        text: "თუ ადამიანი წინდახედული არ არის, მაშინ ის არც გონიერია;",
        correct: false,
      },
      {
        text: "ყველა წინდახედული ადამიანი გონიერია;",
        correct: false,
      },
      {
        text: "ყველა კეთილი ადამიანი გონიერია",
        correct: true,
      },
    ],
  },
  {
    id: 4,
    question: "მოცემულია სამი დებულება:I. არც ერთი მათემატიკოსი არ არის მოთხილამურე.II. ზოგიერთი მათემატიკოსი მელომანია.III. ზოგიერთი მოთხილამურე არ არის მელომანი.ამ დებულებათა შესახებ ქვემოთ წარმოდგენილი მტკიცებებიდან რომელია მართებული?",
    answers: [
      {
        text: " I-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ II ჭეშმარიტია;",
        correct: false,
      },
      {
        text: "არც ერთი მათგანი არ გამომდინარეობს დანარჩენი ორიდან;",
        correct: true,
      },
      {
        text: "I-დან და II-დან ერთად შეგვიძლია დავასკვნათ, რომ III ჭეშმარიტია;",
        correct: false,
      },
      {
        text: "II-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ I მცდარია;",
        correct: false,
      },
    ],
  },
  {
    id: 5,
    question: "მოცემულია დებულებები:ზოგიერთი ფილმი კომედიური ჟანრისაა.ყველა ფილმი, რომელიც კომედიური ჟანრისაა, სასიამოვნო საყურებელია.ლაშას მხოლოდ კომედიური ჟანრის ფილმები მოსწონს.ქვემოთ ჩამოთვლილთაგან რომელი გამომდინარეობს მოცემული დებულებებიდან?",
    answers: [
      {
        text: "თუ ლაშას ფილმი მოსწონს, ის სასიამოვნო საყურებელია.",
        correct: true,
      },
      {
        text: " თუ ფილმი კომედიური ჟანრისაა და საყურებლადაც სასიამოვნოა, ის ლაშას მოეწონება;",
        correct: false,
      },
      {
        text: "თუ ფილმი კომედიური ჟანრისაა, ლაშას ის აუცილებლად მოეწონება; ",
        correct: false,
      },
      {
        text: "თუ ფილმი სასიამოვნო საყურებელია, ის კომედიური ჟანრის უნდა იყოს;",
        correct: false,
      },
    ],
  },
  {
    id: 6,
    question: "მოცემულია გამონათქვამი:არავინაა უნაკლო.ქვემოთ ჩამოთვლილთაგან რომელი დებულება ვერ იქნება ჭეშმარიტი, თუ მოცემული გამონათქვამი ჭეშმარიტია?",
    answers: [
      {
        text: "ზოგიერთ ადამიანს არც ერთი ნაკლი არ აქვს; ",
        correct: true,
      },
      {
        text: "უნაკლო ადამიანი არ არსებობს;",
        correct: false,
      },
      {
        text: "ყოველ ადამიანს ერთი ნაკლი მაინც აქვს;",
        correct: false,
      },
      {
        text: "ზოგიერთ ადამიანს ბევრი ნაკლი აქვს;",
        correct: false,
      },
    ],
  },
  {
    id: 7,
    question: "მოცემულია:არც ერთი სტუდენტი არ არის არასრულწლოვანი.ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად ჭეშმარიტი, თუ მოცემული დებულება ჭეშმარიტია?",
    answers: [
      {
        text: "ყველა სტუდენტი არასრულწლოვანია;",
        correct: false,
      },
      {
        text: "არც ერთი არასრულწლოვანი ადამიანი არ არის სტუდენტი;",
        correct: true,
      },
      {
        text: "ყველა სრულწლოვანი ადამიანი სტუდენტია;",
        correct: false,
      },
      {
        text: "არავინ, ვინც სტუდენტი არ არის, არ არის სრულწლოვანი.",
        correct: false,
      },
    ],
  },
  {
    id: 8,
    question: "გმირთა ცხოვრებამ ------- ისტორია, ------- ისტორიამ ------- გმირთა მამაცობა. ------- იმის გარკვევა, თუ ვინ ვისგან არის დავალებული: მემატიანე მათგან, ვინც უხვი მასალით უზრუნველყო იგი, თუ მემატიანეს უნდა უმადლოდნენ დიდი პიროვნებანი?",
    answers: [
      {
        text: "ვერაფრით გაამდიდრა / ხოლო / არ შეამკო / მიუხედავად ამისა, ადვილი არაა",
        correct: false,
      },
      {
        text: "ვერაფრით გაამდიდრა / თუმცა / დააფასა / მიუხედავად ამისა, ადვილია",
        correct: false,
      },
      {
        text: "გაამდიდრა / ხოლო / შეამკო / ამიტომ ძნელია",
        correct: true,
      },
      {
        text: "გაამდიდრა / თუმცა / ვერ დააფასა / ამიტომ ძნელია",
        correct: false,
      },
    ],
  },
  {
    id: 9,
    question: "------- შემოქმედებითი ადამიანი. პედანტურობა ------- ხელსაყრელია, რადგან ------- ერგები ბიუროკრატიულ და ტექნოკრატიულ კულტურას.",
    answers: [
      {
        text: "არ არის ძნელი, იყო / ნაკლებად / არ გაქვს პასუხები და ვერ",
        correct: false,
      },
      {
        text: " არ არის ძნელი, იყო / ნაკლებად / გაქვს პასუხები და ადვილად",
        correct: false,
      },
      {
        text: "არ არის ადვილი, იყო / ბევრად უფრო / არ გაქვს პასუხები და ვერ",
        correct: false,
      },
      {
        text: "არ არის ადვილი, იყო / ბევრად უფრო / გაქვს პასუხები და ადვილად",
        correct: true,
      },
    ],
  },
  {
    id: 10,
    question: "რომელ ყუთში დევს მილიონი?",
    answers: [
      {
        text: "პირველში",
        correct: false,
      },
      {
        text: "მეორეში",
        correct: false,
      },
      {
        text: "მესამეში",
        correct: false,
      },
      {
        text: "მეოთხეში",
        correct: false,
      },
    ],
  },
  ];

  const moneyPyramid = [
    { id: 1, amount: "₾ 2.000" },
    { id: 2, amount: "₾ 4.000" },
    { id: 3, amount: "₾ 8.000" },
    { id: 4, amount: "₾ 16.000" },
    { id: 5, amount: "₾ 32.000" },
    { id: 6, amount: "₾ 64.000" },
    { id: 7, amount: "₾ 125.000" },
    { id: 8, amount: "₾ 250.000" },
    { id: 9, amount: "₾ 500.000" },
    { id: 10, amount: "₾ 1.000.000" }
  ].reverse();


  useEffect(() => {
    questionNumber > 1 && setEarned(moneyPyramid.find(m => m.id === questionNumber - 1).amount);
  }, [questionNumber]);

  return (
    <div className="App">
      <div className="main">
        {timeOut ? (<h1 className="endText">პასუხი მცდარია, შენ წააგე {earned}</h1>) :
          <>
            <div className="top">
              <div className="timer">
                <Timer
                  setTimeOut={setTimeOut}
                  questionNumber={questionNumber}
                />
              </div>
            </div>
            <div className="bottom">
              <Trivia
                data={data}
                setTimeOut={setTimeOut}
                questionNumber={questionNumber}
                setQuestionNumber={setQuestionNumber}
              />
            </div>
          </>
        }

      </div>
      <div className="pyramid">
        <ul className="moneyList">
          {moneyPyramid.map(m => (
            <li className={questionNumber === m.id ? "moneyListItem active" : "moneyListItem"} >
              <span className="moneyListItemNumber">{m.id} შეკითხვა</span>
              <span className="moneyListItemAmount">- {m.amount}</span>
            </li>
          ))}
        </ul>
      </div>
    </div>
  );
}

export default App;
